/********************************************************************
 *	@program name : UseNumberSystemConversion.c
 *	@author  name : rack
 *	@my      mail : 1740234864@qq.com
 *	@last    date : 2017.11.4
 *	@function     : 栈实现的数制转换，十进制转换为其他进制
 *	@type         : source file
*********************************************************************/

/********************************************************************
*基本操作
*InitStack  初始化栈
*Push       插入元素 进栈
*Pop        删除元素 退栈
*Conversion 数制转换
*数制转换方法：
*设n为需要转换的进制,x为转换的进制
*********************************************************************/

/********************************************************************
 *头文件
*********************************************************************/
#include "NumberSystemConversion.h"


/********************************************************************
 *主函数
*********************************************************************/
int main()
{
	SqStack s                         ;
	int x , n                         ;                         
	printf("请输入十进制数：")        ;                         //输入需要转换的十进制数
	scanf("%d" , &n)                  ;                         //n为输入的十进制数
	printf("请输入需要转换的进制：")  ;                         //输入需要从十进制转换到的进制
	scanf("%d" , &x)                  ;                         //x为需要转换的进制
	InitStack(&s)                     ;                         //初始化栈
	
	Conversion(&s , n , x)            ;                         //进制转换
	return 0                          ;                         //Pop,Push已经在Conversion中完成
}
	
/********************************************************************
 *end
*********************************************************************/
