/********************************************************************
 *	@program name : UseLineEdit.c
 *	@author  name : rack
 *	@my      mail : 1740234864@qq.com
 *	@last    date : 2017.11.9
 *	@function     : 栈实现的行编辑
 *	@type         : main file
*********************************************************************/

/********************************************************************
*基本操作
*InitStack    初始化栈
*DestroyStack 销毁栈
*ClearStack   清空栈
*EmptyStack   判断栈是否为空
*LengthStack  返回栈长度
*GetTop       得到栈顶元素
*Push         插入元素 进栈
*Pop          删除元素 退栈
*LineEdit     行编辑实现函数
*TraveseStack 遍历栈
*行编辑实现方法：
*如果输入的既不是退格符，也不是退行符，则将该字符压入栈顶；如果是一个
*退格符，则删除前一个字符；如果是退行符，则将字符栈清空。
*********************************************************************/

/********************************************************************
 *头文件
*********************************************************************/
#include "LineEdit.h"

/********************************************************************
 *主函数
*********************************************************************/
int main()
{
  /*主函数*/
  char *buf = "whli##ilr#e(s#*s)\noutcha@putchar(*s=#++);";
  printf("请用户输入文本：\n");
  printf("%s\n" , buf);
  printf("\n");
  printf("最终存储的内容：\n");
  LineEdit(buf);
  printf("\n\n");
  return 0 ;
}
