/********************************************************************
 *	@program name : UseSqQueue.c
 *	@author  name : rack
 *	@my      mail : 1740234864@qq.com
 *	@last    date : 2017.11.24
 *	@function     : 循环队列
 *	@type         : main file
*********************************************************************/

/********************************************************************
*基本操作
*InitSqQueue    初始化队列
*DestroySqQueue 销毁队列
*ClearSqQueue   清空队列
*EmptySqQueue   判断队列是否为空
*LengthSqQueue  队列长度
*GetHead        得到队头元素
*EnSqQueue      插入队尾元素
*DeSqQueue      删除对头元素
*SqQueueTraverse遍历元素
*实现原理：
*
*********************************************************************/

/********************************************************************
 *头文件
*********************************************************************/
#include "SqQueue.h"

/********************************************************************
 *主函数
*********************************************************************/
int main()
{
  //主函数
  SqQueue Q ;
  SqElemType e ;
  printf("初始化队列...\n");
  InitSqQueue(&Q);
  printf("\n");

  printf("判断队列是否为空...\n");
  EmptySqQueue(&Q);
  printf("\n");

  //有时间再写
  return 0 ;
}
