/********************************************************************
 *	@program name : UseBankSimulation.c
 *	@author  name : rack
 *	@my      mail : 1740234864@qq.com
 *	@last    date : 2017.11.24
 *	@function     : 银行业务模拟 ， 离散事件模拟
 *	@type         : main file
*********************************************************************/

/********************************************************************
*基本操作
*LinkQueue.h        引用队列结构体和指针
*LinkQueue.c        引用队列函数实现
*BankSimulation     银行模拟函数
*OpenForDay         银行开门
*MoreEvent          判断事件是否为空
*EventDrived        事件驱动
*CustomerArrived    客户到达
*CustomerDeparture  客户离开
*Invalid            事件类型错误
*CloseForDay        银行关门
*cmp                比较两个事件发生的先后次序
*Random             生成随机数，当前业务所务时间和下一个客户达到间隔的时间
*OrderInsert        插入事件
*Minimum            长度最短队列的序号
*Show               显示当前列客户排队情况
*void BankSimulation1 //第二种银行模拟算法
*实现原理：
*建立两个队列，一个是处理客户业务，一个是离开银行
*********************************************************************/

/********************************************************************
 *头文件
*********************************************************************/
#include "BankSimulation.h"

/********************************************************************
 *主函数
*********************************************************************/
int main()
{
  //主函数
  
  return 0 ;
}
