/********************************************************************
 *	@program name : UserSquenceString.c
 *	@author  name : rack
 *	@my      mail : 1740234864@qq.com
 *	@last    date : 2017.12.12
 *	@function     : 顺序串
 *	@type         : main file
*********************************************************************/

/********************************************************************
 *基本操作
 *StrAssign     生成一个子串T
 *StrCopy       由串S复制得到串T
 *StrEmpty      判断串是否为空
 *StrCompare    串比较
 *StrLength     串长度
 *ClearString   清空串
 *SubString     返回主串的第pos个字符串起长度为len的子串
 *Index         返回S中第pos个字符第一次出现的位置
 *ConCat        返回两个串连接成的新串
 *Replace       替换主串中与T子串相等的不重叠的子串
 *StrInsert     在主串中插入子串T
 *StrDelete     在主串中删除第pos个字符起的len长度的子串
 *DestroyString 销毁串
 *StrPrint      字符串打印
*********************************************************************/

/********************************************************************
 *头文件
*********************************************************************/
#include "SquenceString.h"


/********************************************************************
 *函数体
*********************************************************************/
int main()
{
    return 0 ;
}
