/********************************************************************
 *	@program name : LinkedQueue.c
 *	@author  name : rack
 *	@my      mail : 1740234864@qq.com
 *	@last    date : 2017.11.21
 *	@function     : 单链队列
 *	@type         : source file
*********************************************************************/

/********************************************************************
*基本操作
*InitQueue    初始化队列
*DestroyQueue 销毁队列
*ClearQueue   清空队列
*EmptyQueue   判断队列是否为空
*LengthQueue  队列长度
*GetHead      得到队头元素
*EnQueue      插入队尾元素
*DeQueue      删除对头元素
*实现原理：
*
*********************************************************************/
