/*************************************************************************
*	@program    name : UsePerenthesisMatching.c
*	@author     name : rack
*	@author     mail : 1740234864@qq.com
*	@last       date : 2017.11.6
*	@function        : 括号匹配主函数
*	@type            : source file
**************************************************************************/

/*************************************************************************
*头文件
**************************************************************************/
#include "PerenthesisMatching.h"

/*************************************************************************
*主函数
**************************************************************************/
int main()
{
	char str[100] , enter ;
	SqStack *s ;
	InitStack(s);                             //初始化栈
	printf("请输入需要匹配的字符串：\n");
	scanf("%s", str);                         //字符串
	scanf("%c" , enter);                      //字符串中的单个字符
	Matching(s , str);                        //匹配运算
	return 0 ;
}
